First/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

First/src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

First/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

First/src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

First/src/Enums/ТипНоменклатуры/ТипНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

First/src/Documents/ПоступлениеТоваровИУслуг/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма = ТоварыИУслуги.Итог("Сумма");
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	ДвижениеВзаиморасчетыСКонтрагентами = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	ДвижениеВзаиморасчетыСКонтрагентами.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеВзаиморасчетыСКонтрагентами.Период = Дата;
	ДвижениеВзаиморасчетыСКонтрагентами.Контрагент = Поставщик;
	ДвижениеВзаиморасчетыСКонтрагентами.Сумма = Сумма;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровИУслугТоварыИУслуги.Количество КАК Количество,
		|	ПоступлениеТоваровИУслугТоварыИУслуги.Сумма КАК Сумма,
		|	НоменклатураСправочник.Тип КАК Тип
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг.ТоварыИУслуги КАК ПоступлениеТоваровИУслугТоварыИУслуги
		|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
		|		ПО ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура = НоменклатураСправочник.Ссылка
		|ГДЕ
		|	ПоступлениеТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.Товары.Записывать = Истина;
	Движения.Расходы.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипНоменклатуры.Товар Тогда
			ДвижениеТовары = Движения.Товары.Добавить();
			ДвижениеТовары.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеТовары.Период = Дата;
			ДвижениеТовары.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			ДвижениеТовары.Количество = ВыборкаДетальныеЗаписи.Количество;
			ДвижениеТовары.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипНоменклатуры.Услуга Тогда
			ДвижениеРасходы = Движения.Расходы.Добавить();
			ДвижениеРасходы.Период = Дата;
			ДвижениеРасходы.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			ДвижениеРасходы.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		КонецЕсли;
	КонецЦикла;
	
		
	
	
КонецПроцедуры
